FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/timer_reg.h
     * |        |          |0 = PWMx_CH1 level-detect brake event do not happened.
     * |        |          |1 = PWMx_CH1 level-detect brake event happened.
     * |        |          |Note1: This bit is cleared by writing 1 to it.
     * |        |          |Note2: This register is write protected. Refer toSYS_REGLCTL register.
     * |[16]    |BRKESTS0  |Edge -detect Brake Status of PWMx_CH0 (Read Only)
     * |        |          |0 = PWMx_CH0 edge-detect brake state is released.
     * |        |          |1 = PWMx_CH0 at edge-detect brake state.
     * |        |          |Note: User can set BRKEIF0 1 to clear BRKEIF0 flag and PWMx_CH0 will release brake state when current PWM period finished and resume PWMx_CH0 output waveform start from next full PWM period.
     * |[17]    |BRKESTS1  |Edge-detect Brake Status of PWMx_CH1 (Read Only)
     * |        |          |0 = PWMx_CH1 edge-detect brake state is released.
     * |        |          |1 = PWMx_CH1 at edge-detect brake state.
     * |        |          |Note: User can set BRKEIF1 1 to clear BRKEIF1 flag and PWMx_CH1 will release brake state when current PWM period finished and resume PWMx_CH1 output waveform start from next full PWM period.
     * |[24]    |BRKLSTS0  |Level-detect Brake Status of PWMx_CH0 (Read Only)
     * |        |          |0 = PWMx_CH0 level-detect brake state is released.
     * |        |          |1 = PWMx_CH0 at level-detect brake state.
     * |        |          |Note: If TIMERx_PWM level-detect brake source has released, both PWMx_CH0 and PWMx_CH1 will release brake state when current PWM period finished and resume PWMx_CH0 and PWMx_CH1 output waveform start from next full PWM period.
     * |[25]    |BRKLSTS1  |Level-detect Brake Status of PWMx_CH1 (Read Only)
     * |        |          |0 = PWMx_CH1 level-detect brake state is released.
     * |        |          |1 = PWMx_CH1 at level-detect brake state.
     * |        |          |Note: If TIMERx_PWM level-detect brake source has released, both PWMx_CH0 and PWMx_CH1 will release brake state when current PWM period finished and resume PWMx_CH0 and PWMx_CH1 output waveform start from next full PWM period.
     * @var TIMER_T::PWMEADCTS
     * Offset: 0x90  Timer PWM ADC Trigger Source Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |TRGSEL    |PWM Counter Event Source Select to Trigger EADC Conversion
     * |        |          |000 = Trigger EADC conversion at zero point (ZIF).
     * |        |          |001 = Trigger EADC conversion at period point (PIF).
     * |        |          |010 = Trigger EADC conversion at zero or period point (ZIF or PIF).
     * |        |          |011 = Trigger EADC conversion at compare up count point (CMPUIF).
     * |        |          |100 = Trigger EADC conversion at compare down count point (CMPDIF).
     * |        |          |Others = Reserved.
     * |[7]     |TRGEN     |PWM Counter Event Trigger EADC Conversion Enable Bit
     * |        |          |0 = PWM counter event trigger EADC conversion Disabled.
     * |        |          |1 = PWM counter event trigger EADC conversion Enabled.
     * @var TIMER_T::PWMSCTL
     * Offset: 0x94  Timer PWM Synchronous Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |SYNCMODE  |PWM Synchronous Mode Enable Select
     * |        |          |00 = PWM synchronous function Disabled.
     * |        |          |01 = PWM synchronous counter start function Enabled.
     * |        |          |10 = Reserved.
     * |        |          |11 = PWM synchronous counter clear function Enabled.
     * |[8]     |SYNCSRC   |PWM Synchronous Counter Start/Clear Source Select
     * |        |          |0 = Counter synchronous start/clear by trigger TIMER0_PWMSTRG STRGEN.
     * |        |          |1 = Counter synchronous start/clear by trigger TIMER2_PWMSTRG STRGEN.
     * |        |          |Note1: If TIMER0/1/2/3 PWM counter synchronous source are from TIMER0, TIMER0_PWMSCTL[8], TIMER1_PWMSCTL[8], TIMER2_PWMSCTL[8] and TIMER3_PWMSCTL[8] should be 0.
     * |        |          |Note2: If TIMER0/1/ PWM counter synchronous source are from TIMER0, TIMER0_PWMSCTL[8] and TIMER1_PWMSCTL[8] should be set 0, and TIMER2/3/ PWM counter synchronous source are from TIMER2, TIME2_PWMSCTL[8] and TIMER3_PWMSCTL[8] should be set 1.
     * @var TIMER_T::PWMSTRG
     * Offset: 0x98  Timer PWM Synchronous Trigger Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |STRGEN    |PWM Counter Synchronous Trigger Enable Bit (Write Only)
     * |        |          |PMW counter synchronous function is used to make selected PWM channels (include TIMER0/1/2/3 PWM, TIMER0/1 PWM and TIMER2/3 PWM) start counting or clear counter at the same time according to TIMERx_PWMSCTL setting.
     * |        |          |Note: This bit is only available in TIMER0 and TIMER2.
     * @var TIMER_T::PWMSTATUS
     * Offset: 0x9C  Timer PWM Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CNTMAXF   |PWM Counter Equal to 0xFFFF Flag
     * |        |          |0 = Indicates the PWM counter value never reached its maximum value 0xFFFF.
     * |        |          |1 = Indicates the PWM counter value has reached its maximum value.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[16]    |EADCTRGF   |Trigger EADC Start Conversion Flag
     * |        |          |0 = PWM counter event trigger EADC start conversion is not occurred.
     * |        |          |1 = PWM counter event trigger EADC start conversion has occurred.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * @var TIMER_T::PWMPBUF
     * Offset: 0xA0  Timer PWM Period Buffer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PBUF      |PWM Period Buffer Register (Read Only)
     * |        |          |Used as PERIOD active register.
     * @var TIMER_T::PWMCMPBUF
     * Offset: 0xA4  Timer PWM Comparator Buffer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMPBUF    |PWM Comparator Buffer Register (Read Only)
     * |        |          |Used as CMP active register.
     */
    __IO uint32_t CTL;        /*!< [0x0000] Timer Control Register                                          */
    __IO uint32_t CMP;        /*!< [0x0004] Timer Comparator Register                                       */
    __IO uint32_t INTSTS;     /*!< [0x0008] Timer Interrupt Status Register                                 */
    __IO uint32_t CNT;        /*!< [0x000c] Timer Data Register                                             */
    __I uint32_t CAP;         /*!< [0x0010] Timer Capture Data Register                                     */
    __IO uint32_t EXTCTL;     /*!< [0x0014] Timer External Control Register                                 */
    __IO uint32_t EINTSTS;    /*!< [0x0018] Timer External Interrupt Status Register                        */
    __IO uint32_t TRGCTL;     /*!< [0x001c] Timer Trigger Control Register                                  */
    __IO uint32_t ALTCTL;     /*!< [0x0020] Timer Alternative Control Register                              */
    __I uint32_t RESERVE0[ 7 ];
    __IO uint32_t PWMCTL;     /*!< [0x0040] Timer PWM Control Register                                      */
    __IO uint32_t PWMCLKSRC;  /*!< [0x0044] Timer PWM Counter Clock Source Register                         */
    __IO uint32_t PWMCLKPSC;  /*!< [0x0048] Timer PWM Counter Clock Pre-scale Register                      */
    __IO uint32_t PWMCNTCLR;  /*!< [0x004c] Timer PWM Clear Counter Register                                */
    __IO uint32_t PWMPERIOD;  /*!< [0x0050] Timer PWM Period Register                                       */
    __IO uint32_t PWMCMPDAT;  /*!< [0x0054] Timer PWM Comparator Register                                   */
    __IO uint32_t PWMDTCTL;   /*!< [0x0058] Timer PWM Dead-Time Control Register                            */
    __I uint32_t PWMCNT;      /*!< [0x005c] Timer PWM Counter Register                                      */
    __IO uint32_t PWMMSKEN;   /*!< [0x0060] Timer PWM Output Mask Enable Register                           */
    __IO uint32_t PWMMSK;     /*!< [0x0064] Timer PWM Output Mask Data Control Register                     */
    __IO uint32_t PWMBNF;     /*!< [0x0068] Timer PWM Brake Pin Noise Filter Register                       */
    __IO uint32_t PWMFAILBRK; /*!< [0x006c] Timer PWM System Fail Brake Control Register                    */
    __IO uint32_t PWMBRKCTL;  /*!< [0x0070] Timer PWM Brake Control Register                                */
    __IO uint32_t PWMPOLCTL;  /*!< [0x0074] Timer PWM Pin Output Polar Control Register                     */
    __IO uint32_t PWMPOEN;    /*!< [0x0078] Timer PWM Pin Output Enable Register                            */
    __O uint32_t PWMSWBRK;    /*!< [0x007c] Timer PWM Software Trigger Brake Control Register               */
    __IO uint32_t PWMINTEN0;  /*!< [0x0080] Timer PWM Interrupt Enable Register 0                           */
    __IO uint32_t PWMINTEN1;  /*!< [0x0084] Timer PWM Interrupt Enable Register 1                           */
    __IO uint32_t PWMINTSTS0; /*!< [0x0088] Timer PWM Interrupt Status Register 0                           */
    __IO uint32_t PWMINTSTS1; /*!< [0x008c] Timer PWM Interrupt Status Register 1                           */
    __IO uint32_t PWMEADCTS;  /*!< [0x0090] Timer PWM ADC Trigger Source Select Register                    */
    __IO uint32_t PWMSCTL;    /*!< [0x0094] Timer PWM Synchronous Control Register                          */
    __O uint32_t PWMSTRG;     /*!< [0x0098] Timer PWM Synchronous Trigger Register                          */
    __IO uint32_t PWMSTATUS;  /*!< [0x009c] Timer PWM Status Register                                       */
    __I uint32_t PWMPBUF;     /*!< [0x00a0] Timer PWM Period Buffer Register                                */
    __I uint32_t PWMCMPBUF;   /*!< [0x00a4] Timer PWM Comparator Buffer Register                            */
} TIMER_T;

/**
 *  @addtogroup TIMER_CONST TIMER Bit Field Definition
 *  Constant Definitions for TIMER Controller
 * @{ */

#define TIMER_CTL_PSC_Pos                ( 0 )                                             /*!< TIMER_T::CTL: PSC Position             */
#define TIMER_CTL_PSC_Msk                ( 0xfful << TIMER_CTL_PSC_Pos )                   /*!< TIMER_T::CTL: PSC Mask                 */

#define TIMER_CTL_INTRGEN_Pos            ( 19 )                                            /*!< TIMER_T::CTL: INTRGEN Position         */
#define TIMER_CTL_INTRGEN_Msk            ( 0x1ul << TIMER_CTL_INTRGEN_Pos )                /*!< TIMER_T::CTL: INTRGEN Mask             */

#define TIMER_CTL_PERIOSEL_Pos           ( 20 )                                            /*!< TIMER_T::CTL: PERIOSEL Position        */
#define TIMER_CTL_PERIOSEL_Msk           ( 0x1ul << TIMER_CTL_PERIOSEL_Pos )               /*!< TIMER_T::CTL: PERIOSEL Mask            */

#define TIMER_CTL_TGLPINSEL_Pos          ( 21 )                                            /*!< TIMER_T::CTL: TGLPINSEL Position       */
#define TIMER_CTL_TGLPINSEL_Msk          ( 0x1ul << TIMER_CTL_TGLPINSEL_Pos )              /*!< TIMER_T::CTL: TGLPINSEL Mask           */

#define TIMER_CTL_CAPSRC_Pos             ( 22 )                                            /*!< TIMER_T::CTL: CAPSRC Position          */
#define TIMER_CTL_CAPSRC_Msk             ( 0x1ul << TIMER_CTL_CAPSRC_Pos )                 /*!< TIMER_T::CTL: CAPSRC Mask              */

#define TIMER_CTL_WKEN_Pos               ( 23 )                                            /*!< TIMER_T::CTL: WKEN Position            */
#define TIMER_CTL_WKEN_Msk               ( 0x1ul << TIMER_CTL_WKEN_Pos )                   /*!< TIMER_T::CTL: WKEN Mask                */

