FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/timer_reg.h
#define TIMER_CTL_EXTCNTEN_Pos           ( 24 )                                            /*!< TIMER_T::CTL: EXTCNTEN Position        */
#define TIMER_CTL_EXTCNTEN_Msk           ( 0x1ul << TIMER_CTL_EXTCNTEN_Pos )               /*!< TIMER_T::CTL: EXTCNTEN Mask            */

#define TIMER_CTL_ACTSTS_Pos             ( 25 )                                            /*!< TIMER_T::CTL: ACTSTS Position          */
#define TIMER_CTL_ACTSTS_Msk             ( 0x1ul << TIMER_CTL_ACTSTS_Pos )                 /*!< TIMER_T::CTL: ACTSTS Mask              */

#define TIMER_CTL_OPMODE_Pos             ( 27 )                                            /*!< TIMER_T::CTL: OPMODE Position          */
#define TIMER_CTL_OPMODE_Msk             ( 0x3ul << TIMER_CTL_OPMODE_Pos )                 /*!< TIMER_T::CTL: OPMODE Mask              */

#define TIMER_CTL_INTEN_Pos              ( 29 )                                            /*!< TIMER_T::CTL: INTEN Position           */
#define TIMER_CTL_INTEN_Msk              ( 0x1ul << TIMER_CTL_INTEN_Pos )                  /*!< TIMER_T::CTL: INTEN Mask               */

#define TIMER_CTL_CNTEN_Pos              ( 30 )                                            /*!< TIMER_T::CTL: CNTEN Position           */
#define TIMER_CTL_CNTEN_Msk              ( 0x1ul << TIMER_CTL_CNTEN_Pos )                  /*!< TIMER_T::CTL: CNTEN Mask               */

#define TIMER_CTL_ICEDEBUG_Pos           ( 31 )                                            /*!< TIMER_T::CTL: ICEDEBUG Position        */
#define TIMER_CTL_ICEDEBUG_Msk           ( 0x1ul << TIMER_CTL_ICEDEBUG_Pos )               /*!< TIMER_T::CTL: ICEDEBUG Mask            */

#define TIMER_CMP_CMPDAT_Pos             ( 0 )                                             /*!< TIMER_T::CMP: CMPDAT Position          */
#define TIMER_CMP_CMPDAT_Msk             ( 0xfffffful << TIMER_CMP_CMPDAT_Pos )            /*!< TIMER_T::CMP: CMPDAT Mask              */

#define TIMER_INTSTS_TIF_Pos             ( 0 )                                             /*!< TIMER_T::INTSTS: TIF Position          */
#define TIMER_INTSTS_TIF_Msk             ( 0x1ul << TIMER_INTSTS_TIF_Pos )                 /*!< TIMER_T::INTSTS: TIF Mask              */

#define TIMER_INTSTS_TWKF_Pos            ( 1 )                                             /*!< TIMER_T::INTSTS: TWKF Position         */
#define TIMER_INTSTS_TWKF_Msk            ( 0x1ul << TIMER_INTSTS_TWKF_Pos )                /*!< TIMER_T::INTSTS: TWKF Mask             */

#define TIMER_CNT_CNT_Pos                ( 0 )                                             /*!< TIMER_T::CNT: CNT Position             */
#define TIMER_CNT_CNT_Msk                ( 0xfffffful << TIMER_CNT_CNT_Pos )               /*!< TIMER_T::CNT: CNT Mask                 */

#define TIMER_CNT_RSTACT_Pos             ( 31 )                                            /*!< TIMER_T::CNT: RSTACT Position          */
#define TIMER_CNT_RSTACT_Msk             ( 0x1ul << TIMER_CNT_RSTACT_Pos )                 /*!< TIMER_T::CNT: RSTACT Mask              */

#define TIMER_CAP_CAPDAT_Pos             ( 0 )                                             /*!< TIMER_T::CAP: CAPDAT Position          */
#define TIMER_CAP_CAPDAT_Msk             ( 0xfffffful << TIMER_CAP_CAPDAT_Pos )            /*!< TIMER_T::CAP: CAPDAT Mask              */

#define TIMER_EXTCTL_CNTPHASE_Pos        ( 0 )                                             /*!< TIMER_T::EXTCTL: CNTPHASE Position     */
#define TIMER_EXTCTL_CNTPHASE_Msk        ( 0x1ul << TIMER_EXTCTL_CNTPHASE_Pos )            /*!< TIMER_T::EXTCTL: CNTPHASE Mask         */

#define TIMER_EXTCTL_CAPEN_Pos           ( 3 )                                             /*!< TIMER_T::EXTCTL: CAPEN Position        */
#define TIMER_EXTCTL_CAPEN_Msk           ( 0x1ul << TIMER_EXTCTL_CAPEN_Pos )               /*!< TIMER_T::EXTCTL: CAPEN Mask            */

#define TIMER_EXTCTL_CAPFUNCS_Pos        ( 4 )                                             /*!< TIMER_T::EXTCTL: CAPFUNCS Position     */
#define TIMER_EXTCTL_CAPFUNCS_Msk        ( 0x1ul << TIMER_EXTCTL_CAPFUNCS_Pos )            /*!< TIMER_T::EXTCTL: CAPFUNCS Mask         */

#define TIMER_EXTCTL_CAPIEN_Pos          ( 5 )                                             /*!< TIMER_T::EXTCTL: CAPIEN Position       */
#define TIMER_EXTCTL_CAPIEN_Msk          ( 0x1ul << TIMER_EXTCTL_CAPIEN_Pos )              /*!< TIMER_T::EXTCTL: CAPIEN Mask           */

#define TIMER_EXTCTL_CAPDBEN_Pos         ( 6 )                                             /*!< TIMER_T::EXTCTL: CAPDBEN Position      */
#define TIMER_EXTCTL_CAPDBEN_Msk         ( 0x1ul << TIMER_EXTCTL_CAPDBEN_Pos )             /*!< TIMER_T::EXTCTL: CAPDBEN Mask          */

#define TIMER_EXTCTL_CNTDBEN_Pos         ( 7 )                                             /*!< TIMER_T::EXTCTL: CNTDBEN Position      */
#define TIMER_EXTCTL_CNTDBEN_Msk         ( 0x1ul << TIMER_EXTCTL_CNTDBEN_Pos )             /*!< TIMER_T::EXTCTL: CNTDBEN Mask          */

#define TIMER_EXTCTL_ACMPSSEL_Pos        ( 8 )                                             /*!< TIMER_T::EXTCTL: ACMPSSEL Position     */
#define TIMER_EXTCTL_ACMPSSEL_Msk        ( 0x1ul << TIMER_EXTCTL_ACMPSSEL_Pos )            /*!< TIMER_T::EXTCTL: ACMPSSEL Mask         */

#define TIMER_EXTCTL_CAPEDGE_Pos         ( 12 )                                            /*!< TIMER_T::EXTCTL: CAPEDGE Position      */
#define TIMER_EXTCTL_CAPEDGE_Msk         ( 0x7ul << TIMER_EXTCTL_CAPEDGE_Pos )             /*!< TIMER_T::EXTCTL: CAPEDGE Mask          */

#define TIMER_EXTCTL_ECNTSSEL_Pos        ( 16 )                                            /*!< TIMER_T::EXTCTL: ECNTSSEL Position     */
#define TIMER_EXTCTL_ECNTSSEL_Msk        ( 0x1ul << TIMER_EXTCTL_ECNTSSEL_Pos )            /*!< TIMER_T::EXTCTL: ECNTSSEL Mask         */

#define TIMER_EINTSTS_CAPIF_Pos          ( 0 )                                             /*!< TIMER_T::EINTSTS: CAPIF Position       */
#define TIMER_EINTSTS_CAPIF_Msk          ( 0x1ul << TIMER_EINTSTS_CAPIF_Pos )              /*!< TIMER_T::EINTSTS: CAPIF Mask           */

