FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/timer_reg.h
#define TIMER_PWMINTSTS1_BRKLIF1_Pos     ( 9 )                                             /*!< TIMER_T::PWMINTSTS1: BRKLIF1 Position  */
#define TIMER_PWMINTSTS1_BRKLIF1_Msk     ( 0x1ul << TIMER_PWMINTSTS1_BRKLIF1_Pos )         /*!< TIMER_T::PWMINTSTS1: BRKLIF1 Mask      */

#define TIMER_PWMINTSTS1_BRKESTS0_Pos    ( 16 )                                            /*!< TIMER_T::PWMINTSTS1: BRKESTS0 Position */
#define TIMER_PWMINTSTS1_BRKESTS0_Msk    ( 0x1ul << TIMER_PWMINTSTS1_BRKESTS0_Pos )        /*!< TIMER_T::PWMINTSTS1: BRKESTS0 Mask     */

#define TIMER_PWMINTSTS1_BRKESTS1_Pos    ( 17 )                                            /*!< TIMER_T::PWMINTSTS1: BRKESTS1 Position */
#define TIMER_PWMINTSTS1_BRKESTS1_Msk    ( 0x1ul << TIMER_PWMINTSTS1_BRKESTS1_Pos )        /*!< TIMER_T::PWMINTSTS1: BRKESTS1 Mask     */

#define TIMER_PWMINTSTS1_BRKLSTS0_Pos    ( 24 )                                            /*!< TIMER_T::PWMINTSTS1: BRKLSTS0 Position */
#define TIMER_PWMINTSTS1_BRKLSTS0_Msk    ( 0x1ul << TIMER_PWMINTSTS1_BRKLSTS0_Pos )        /*!< TIMER_T::PWMINTSTS1: BRKLSTS0 Mask     */

#define TIMER_PWMINTSTS1_BRKLSTS1_Pos    ( 25 )                                            /*!< TIMER_T::PWMINTSTS1: BRKLSTS1 Position */
#define TIMER_PWMINTSTS1_BRKLSTS1_Msk    ( 0x1ul << TIMER_PWMINTSTS1_BRKLSTS1_Pos )        /*!< TIMER_T::PWMINTSTS1: BRKLSTS1 Mask     */

#define TIMER_PWMEADCTS_TRGSEL_Pos       ( 0 )                                             /*!< TIMER_T::PWMEADCTS: TRGSEL Position    */
#define TIMER_PWMEADCTS_TRGSEL_Msk       ( 0x7ul << TIMER_PWMEADCTS_TRGSEL_Pos )           /*!< TIMER_T::PWMEADCTS: TRGSEL Mask        */

#define TIMER_PWMEADCTS_TRGEN_Pos        ( 7 )                                             /*!< TIMER_T::PWMEADCTS: TRGEN Position     */
#define TIMER_PWMEADCTS_TRGEN_Msk        ( 0x1ul << TIMER_PWMEADCTS_TRGEN_Pos )            /*!< TIMER_T::PWMEADCTS: TRGEN Mask         */

#define TIMER_PWMSCTL_SYNCMODE_Pos       ( 0 )                                             /*!< TIMER_T::PWMSCTL: SYNCMODE Position    */
#define TIMER_PWMSCTL_SYNCMODE_Msk       ( 0x3ul << TIMER_PWMSCTL_SYNCMODE_Pos )           /*!< TIMER_T::PWMSCTL: SYNCMODE Mask        */

#define TIMER_PWMSCTL_SYNCSRC_Pos        ( 8 )                                             /*!< TIMER_T::PWMSCTL: SYNCSRC Position     */
#define TIMER_PWMSCTL_SYNCSRC_Msk        ( 0x1ul << TIMER_PWMSCTL_SYNCSRC_Pos )            /*!< TIMER_T::PWMSCTL: SYNCSRC Mask         */

#define TIMER_PWMSTRG_STRGEN_Pos         ( 0 )                                             /*!< TIMER_T::PWMSTRG: STRGEN Position      */
#define TIMER_PWMSTRG_STRGEN_Msk         ( 0x1ul << TIMER_PWMSTRG_STRGEN_Pos )             /*!< TIMER_T::PWMSTRG: STRGEN Mask          */

#define TIMER_PWMSTATUS_CNTMAXF_Pos      ( 0 )                                             /*!< TIMER_T::PWMSTATUS: CNTMAXF Position   */
#define TIMER_PWMSTATUS_CNTMAXF_Msk      ( 0x1ul << TIMER_PWMSTATUS_CNTMAXF_Pos )          /*!< TIMER_T::PWMSTATUS: CNTMAXF Mask       */

#define TIMER_PWMSTATUS_EADCTRGF_Pos     ( 16 )                                            /*!< TIMER_T::PWMSTATUS: EADCTRGF Position   */
#define TIMER_PWMSTATUS_EADCTRGF_Msk     ( 0x1ul << TIMER_PWMSTATUS_EADCTRGF_Pos )         /*!< TIMER_T::PWMSTATUS: EADCTRGF Mask       */

#define TIMER_PWMPBUF_PBUF_Pos           ( 0 )                                             /*!< TIMER_T::PWMPBUF: PBUF Position        */
#define TIMER_PWMPBUF_PBUF_Msk           ( 0xfffful << TIMER_PWMPBUF_PBUF_Pos )            /*!< TIMER_T::PWMPBUF: PBUF Mask            */

#define TIMER_PWMCMPBUF_CMPBUF_Pos       ( 0 )                                             /*!< TIMER_T::PWMCMPBUF: CMPBUF Position    */
#define TIMER_PWMCMPBUF_CMPBUF_Msk       ( 0xfffful << TIMER_PWMCMPBUF_CMPBUF_Pos )        /*!< TIMER_T::PWMCMPBUF: CMPBUF Mask        */

/**@}*/ /* TIMER_CONST */
/**@}*/ /* end of TIMER register group */
/**@}*/ /* end of REGISTER group */

#endif /* __TIMER_REG_H__ */
